GopalSaraf/Practicals/PSDL/include/proc/pic16lf19155.inc
// Register: ADCON1
#define ADCON1 ADCON1
ADCON1                                   equ 0112h
// bitfield definitions
ADCON1_DSEN_POSN                         equ 0000h
ADCON1_DSEN_POSITION                     equ 0000h
ADCON1_DSEN_SIZE                         equ 0001h
ADCON1_DSEN_LENGTH                       equ 0001h
ADCON1_DSEN_MASK                         equ 0001h
ADCON1_GPOL_POSN                         equ 0005h
ADCON1_GPOL_POSITION                     equ 0005h
ADCON1_GPOL_SIZE                         equ 0001h
ADCON1_GPOL_LENGTH                       equ 0001h
ADCON1_GPOL_MASK                         equ 0020h
ADCON1_IPEN_POSN                         equ 0006h
ADCON1_IPEN_POSITION                     equ 0006h
ADCON1_IPEN_SIZE                         equ 0001h
ADCON1_IPEN_LENGTH                       equ 0001h
ADCON1_IPEN_MASK                         equ 0040h
ADCON1_PPOL_POSN                         equ 0007h
ADCON1_PPOL_POSITION                     equ 0007h
ADCON1_PPOL_SIZE                         equ 0001h
ADCON1_PPOL_LENGTH                       equ 0001h
ADCON1_PPOL_MASK                         equ 0080h
ADCON1_ADDSEN_POSN                       equ 0000h
ADCON1_ADDSEN_POSITION                   equ 0000h
ADCON1_ADDSEN_SIZE                       equ 0001h
ADCON1_ADDSEN_LENGTH                     equ 0001h
ADCON1_ADDSEN_MASK                       equ 0001h
ADCON1_ADGPOL_POSN                       equ 0005h
ADCON1_ADGPOL_POSITION                   equ 0005h
ADCON1_ADGPOL_SIZE                       equ 0001h
ADCON1_ADGPOL_LENGTH                     equ 0001h
ADCON1_ADGPOL_MASK                       equ 0020h
ADCON1_ADIPEN_POSN                       equ 0006h
ADCON1_ADIPEN_POSITION                   equ 0006h
ADCON1_ADIPEN_SIZE                       equ 0001h
ADCON1_ADIPEN_LENGTH                     equ 0001h
ADCON1_ADIPEN_MASK                       equ 0040h
ADCON1_ADPPOL_POSN                       equ 0007h
ADCON1_ADPPOL_POSITION                   equ 0007h
ADCON1_ADPPOL_SIZE                       equ 0001h
ADCON1_ADPPOL_LENGTH                     equ 0001h
ADCON1_ADPPOL_MASK                       equ 0080h

// Register: ADCON2
#define ADCON2 ADCON2
ADCON2                                   equ 0113h
// bitfield definitions
ADCON2_MODE_POSN                         equ 0000h
ADCON2_MODE_POSITION                     equ 0000h
ADCON2_MODE_SIZE                         equ 0003h
ADCON2_MODE_LENGTH                       equ 0003h
ADCON2_MODE_MASK                         equ 0007h
ADCON2_ACLR_POSN                         equ 0003h
ADCON2_ACLR_POSITION                     equ 0003h
ADCON2_ACLR_SIZE                         equ 0001h
ADCON2_ACLR_LENGTH                       equ 0001h
ADCON2_ACLR_MASK                         equ 0008h
ADCON2_CRS_POSN                          equ 0004h
ADCON2_CRS_POSITION                      equ 0004h
ADCON2_CRS_SIZE                          equ 0003h
ADCON2_CRS_LENGTH                        equ 0003h
ADCON2_CRS_MASK                          equ 0070h
ADCON2_PSIS_POSN                         equ 0007h
ADCON2_PSIS_POSITION                     equ 0007h
ADCON2_PSIS_SIZE                         equ 0001h
ADCON2_PSIS_LENGTH                       equ 0001h
ADCON2_PSIS_MASK                         equ 0080h
ADCON2_ADMD0_POSN                        equ 0000h
ADCON2_ADMD0_POSITION                    equ 0000h
ADCON2_ADMD0_SIZE                        equ 0001h
ADCON2_ADMD0_LENGTH                      equ 0001h
ADCON2_ADMD0_MASK                        equ 0001h
ADCON2_ADMD1_POSN                        equ 0001h
ADCON2_ADMD1_POSITION                    equ 0001h
ADCON2_ADMD1_SIZE                        equ 0001h
ADCON2_ADMD1_LENGTH                      equ 0001h
ADCON2_ADMD1_MASK                        equ 0002h
ADCON2_ADMD2_POSN                        equ 0002h
ADCON2_ADMD2_POSITION                    equ 0002h
ADCON2_ADMD2_SIZE                        equ 0001h
ADCON2_ADMD2_LENGTH                      equ 0001h
ADCON2_ADMD2_MASK                        equ 0004h
ADCON2_ADACLR_POSN                       equ 0003h
ADCON2_ADACLR_POSITION                   equ 0003h
ADCON2_ADACLR_SIZE                       equ 0001h
ADCON2_ADACLR_LENGTH                     equ 0001h
ADCON2_ADACLR_MASK                       equ 0008h
ADCON2_ADCRS0_POSN                       equ 0004h
ADCON2_ADCRS0_POSITION                   equ 0004h
ADCON2_ADCRS0_SIZE                       equ 0001h
ADCON2_ADCRS0_LENGTH                     equ 0001h
ADCON2_ADCRS0_MASK                       equ 0010h
ADCON2_ADCRS1_POSN                       equ 0005h
ADCON2_ADCRS1_POSITION                   equ 0005h
ADCON2_ADCRS1_SIZE                       equ 0001h
ADCON2_ADCRS1_LENGTH                     equ 0001h
ADCON2_ADCRS1_MASK                       equ 0020h
ADCON2_ADCRS2_POSN                       equ 0006h
ADCON2_ADCRS2_POSITION                   equ 0006h
ADCON2_ADCRS2_SIZE                       equ 0001h
ADCON2_ADCRS2_LENGTH                     equ 0001h
ADCON2_ADCRS2_MASK                       equ 0040h
ADCON2_ADPSIS_POSN                       equ 0007h
ADCON2_ADPSIS_POSITION                   equ 0007h
ADCON2_ADPSIS_SIZE                       equ 0001h
ADCON2_ADPSIS_LENGTH                     equ 0001h
ADCON2_ADPSIS_MASK                       equ 0080h
ADCON2_ADMD_POSN                         equ 0000h
ADCON2_ADMD_POSITION                     equ 0000h
ADCON2_ADMD_SIZE                         equ 0003h
ADCON2_ADMD_LENGTH                       equ 0003h
ADCON2_ADMD_MASK                         equ 0007h
ADCON2_ADCRS_POSN                        equ 0004h
ADCON2_ADCRS_POSITION                    equ 0004h
ADCON2_ADCRS_SIZE                        equ 0003h
ADCON2_ADCRS_LENGTH                      equ 0003h
ADCON2_ADCRS_MASK                        equ 0070h
ADCON2_MODE0_POSN                        equ 0000h
ADCON2_MODE0_POSITION                    equ 0000h
ADCON2_MODE0_SIZE                        equ 0001h
ADCON2_MODE0_LENGTH                      equ 0001h
ADCON2_MODE0_MASK                        equ 0001h
ADCON2_MODE1_POSN                        equ 0001h
ADCON2_MODE1_POSITION                    equ 0001h
ADCON2_MODE1_SIZE                        equ 0001h
ADCON2_MODE1_LENGTH                      equ 0001h
ADCON2_MODE1_MASK                        equ 0002h
ADCON2_MODE2_POSN                        equ 0002h
ADCON2_MODE2_POSITION                    equ 0002h
ADCON2_MODE2_SIZE                        equ 0001h
ADCON2_MODE2_LENGTH                      equ 0001h
ADCON2_MODE2_MASK                        equ 0004h
ADCON2_CRS0_POSN                         equ 0004h
ADCON2_CRS0_POSITION                     equ 0004h
ADCON2_CRS0_SIZE                         equ 0001h
ADCON2_CRS0_LENGTH                       equ 0001h
ADCON2_CRS0_MASK                         equ 0010h
ADCON2_CRS1_POSN                         equ 0005h
ADCON2_CRS1_POSITION                     equ 0005h
ADCON2_CRS1_SIZE                         equ 0001h
ADCON2_CRS1_LENGTH                       equ 0001h
ADCON2_CRS1_MASK                         equ 0020h
ADCON2_CRS2_POSN                         equ 0006h
ADCON2_CRS2_POSITION                     equ 0006h
ADCON2_CRS2_SIZE                         equ 0001h
ADCON2_CRS2_LENGTH                       equ 0001h
ADCON2_CRS2_MASK                         equ 0040h
ADCON2_MD_POSN                           equ 0000h
ADCON2_MD_POSITION                       equ 0000h
ADCON2_MD_SIZE                           equ 0003h
ADCON2_MD_LENGTH                         equ 0003h
ADCON2_MD_MASK                           equ 0007h
ADCON2_MD0_POSN                          equ 0000h
ADCON2_MD0_POSITION                      equ 0000h
ADCON2_MD0_SIZE                          equ 0001h
ADCON2_MD0_LENGTH                        equ 0001h
ADCON2_MD0_MASK                          equ 0001h
ADCON2_MD1_POSN                          equ 0001h
ADCON2_MD1_POSITION                      equ 0001h
ADCON2_MD1_SIZE                          equ 0001h
ADCON2_MD1_LENGTH                        equ 0001h
ADCON2_MD1_MASK                          equ 0002h
ADCON2_MD2_POSN                          equ 0002h
ADCON2_MD2_POSITION                      equ 0002h
ADCON2_MD2_SIZE                          equ 0001h
ADCON2_MD2_LENGTH                        equ 0001h
ADCON2_MD2_MASK                          equ 0004h

// Register: ADCON3
#define ADCON3 ADCON3
ADCON3                                   equ 0114h
// bitfield definitions
ADCON3_TMD_POSN                          equ 0000h
ADCON3_TMD_POSITION                      equ 0000h
ADCON3_TMD_SIZE                          equ 0003h
ADCON3_TMD_LENGTH                        equ 0003h
ADCON3_TMD_MASK                          equ 0007h
ADCON3_SOI_POSN                          equ 0003h
ADCON3_SOI_POSITION                      equ 0003h
ADCON3_SOI_SIZE                          equ 0001h
ADCON3_SOI_LENGTH                        equ 0001h
ADCON3_SOI_MASK                          equ 0008h
ADCON3_CALC_POSN                         equ 0004h
ADCON3_CALC_POSITION                     equ 0004h
ADCON3_CALC_SIZE                         equ 0003h
ADCON3_CALC_LENGTH                       equ 0003h
ADCON3_CALC_MASK                         equ 0070h
ADCON3_ADTMD0_POSN                       equ 0000h
ADCON3_ADTMD0_POSITION                   equ 0000h
ADCON3_ADTMD0_SIZE                       equ 0001h
ADCON3_ADTMD0_LENGTH                     equ 0001h
ADCON3_ADTMD0_MASK                       equ 0001h
ADCON3_ADTMD1_POSN                       equ 0001h
ADCON3_ADTMD1_POSITION                   equ 0001h
ADCON3_ADTMD1_SIZE                       equ 0001h
ADCON3_ADTMD1_LENGTH                     equ 0001h
ADCON3_ADTMD1_MASK                       equ 0002h
ADCON3_ADTMD2_POSN                       equ 0002h
ADCON3_ADTMD2_POSITION                   equ 0002h
ADCON3_ADTMD2_SIZE                       equ 0001h
ADCON3_ADTMD2_LENGTH                     equ 0001h
ADCON3_ADTMD2_MASK                       equ 0004h
ADCON3_ADSOI_POSN                        equ 0003h
ADCON3_ADSOI_POSITION                    equ 0003h
ADCON3_ADSOI_SIZE                        equ 0001h
ADCON3_ADSOI_LENGTH                      equ 0001h
ADCON3_ADSOI_MASK                        equ 0008h
ADCON3_ADCALC0_POSN                      equ 0004h
ADCON3_ADCALC0_POSITION                  equ 0004h
ADCON3_ADCALC0_SIZE                      equ 0001h
ADCON3_ADCALC0_LENGTH                    equ 0001h
ADCON3_ADCALC0_MASK                      equ 0010h
ADCON3_ADCALC1_POSN                      equ 0005h
ADCON3_ADCALC1_POSITION                  equ 0005h
ADCON3_ADCALC1_SIZE                      equ 0001h
ADCON3_ADCALC1_LENGTH                    equ 0001h
ADCON3_ADCALC1_MASK                      equ 0020h
ADCON3_ADCALC2_POSN                      equ 0006h
ADCON3_ADCALC2_POSITION                  equ 0006h
ADCON3_ADCALC2_SIZE                      equ 0001h
ADCON3_ADCALC2_LENGTH                    equ 0001h
ADCON3_ADCALC2_MASK                      equ 0040h
ADCON3_ADTMD_POSN                        equ 0000h
ADCON3_ADTMD_POSITION                    equ 0000h
ADCON3_ADTMD_SIZE                        equ 0003h
ADCON3_ADTMD_LENGTH                      equ 0003h
ADCON3_ADTMD_MASK                        equ 0007h
ADCON3_ADCALC_POSN                       equ 0004h
ADCON3_ADCALC_POSITION                   equ 0004h
ADCON3_ADCALC_SIZE                       equ 0003h
ADCON3_ADCALC_LENGTH                     equ 0003h
ADCON3_ADCALC_MASK                       equ 0070h
ADCON3_TMD0_POSN                         equ 0000h
ADCON3_TMD0_POSITION                     equ 0000h
ADCON3_TMD0_SIZE                         equ 0001h
ADCON3_TMD0_LENGTH                       equ 0001h
ADCON3_TMD0_MASK                         equ 0001h
ADCON3_TMD1_POSN                         equ 0001h
ADCON3_TMD1_POSITION                     equ 0001h
ADCON3_TMD1_SIZE                         equ 0001h
ADCON3_TMD1_LENGTH                       equ 0001h
ADCON3_TMD1_MASK                         equ 0002h
ADCON3_TMD2_POSN                         equ 0002h
ADCON3_TMD2_POSITION                     equ 0002h
ADCON3_TMD2_SIZE                         equ 0001h
ADCON3_TMD2_LENGTH                       equ 0001h
ADCON3_TMD2_MASK                         equ 0004h
ADCON3_CALC0_POSN                        equ 0004h
ADCON3_CALC0_POSITION                    equ 0004h
ADCON3_CALC0_SIZE                        equ 0001h
ADCON3_CALC0_LENGTH                      equ 0001h
ADCON3_CALC0_MASK                        equ 0010h
ADCON3_CALC1_POSN                        equ 0005h
ADCON3_CALC1_POSITION                    equ 0005h
ADCON3_CALC1_SIZE                        equ 0001h
ADCON3_CALC1_LENGTH                      equ 0001h
ADCON3_CALC1_MASK                        equ 0020h
ADCON3_CALC2_POSN                        equ 0006h
ADCON3_CALC2_POSITION                    equ 0006h
ADCON3_CALC2_SIZE                        equ 0001h
ADCON3_CALC2_LENGTH                      equ 0001h
ADCON3_CALC2_MASK                        equ 0040h

// Register: ADSTAT
#define ADSTAT ADSTAT
ADSTAT                                   equ 0115h
// bitfield definitions
ADSTAT_STAT_POSN                         equ 0000h
ADSTAT_STAT_POSITION                     equ 0000h
ADSTAT_STAT_SIZE                         equ 0003h
ADSTAT_STAT_LENGTH                       equ 0003h
ADSTAT_STAT_MASK                         equ 0007h
ADSTAT_MATH_POSN                         equ 0004h
ADSTAT_MATH_POSITION                     equ 0004h
ADSTAT_MATH_SIZE                         equ 0001h
ADSTAT_MATH_LENGTH                       equ 0001h
ADSTAT_MATH_MASK                         equ 0010h
ADSTAT_LTHR_POSN                         equ 0005h
ADSTAT_LTHR_POSITION                     equ 0005h
ADSTAT_LTHR_SIZE                         equ 0001h
ADSTAT_LTHR_LENGTH                       equ 0001h
ADSTAT_LTHR_MASK                         equ 0020h
ADSTAT_UTHR_POSN                         equ 0006h
ADSTAT_UTHR_POSITION                     equ 0006h
ADSTAT_UTHR_SIZE                         equ 0001h
ADSTAT_UTHR_LENGTH                       equ 0001h
ADSTAT_UTHR_MASK                         equ 0040h
ADSTAT_OV_POSN                           equ 0007h
ADSTAT_OV_POSITION                       equ 0007h
ADSTAT_OV_SIZE                           equ 0001h
ADSTAT_OV_LENGTH                         equ 0001h
ADSTAT_OV_MASK                           equ 0080h
ADSTAT_ADSTAT0_POSN                      equ 0000h
ADSTAT_ADSTAT0_POSITION                  equ 0000h
ADSTAT_ADSTAT0_SIZE                      equ 0001h
ADSTAT_ADSTAT0_LENGTH                    equ 0001h
ADSTAT_ADSTAT0_MASK                      equ 0001h
ADSTAT_ADSTAT1_POSN                      equ 0001h
ADSTAT_ADSTAT1_POSITION                  equ 0001h
ADSTAT_ADSTAT1_SIZE                      equ 0001h
ADSTAT_ADSTAT1_LENGTH                    equ 0001h
ADSTAT_ADSTAT1_MASK                      equ 0002h
ADSTAT_ADSTAT2_POSN                      equ 0002h
ADSTAT_ADSTAT2_POSITION                  equ 0002h
ADSTAT_ADSTAT2_SIZE                      equ 0001h
ADSTAT_ADSTAT2_LENGTH                    equ 0001h
ADSTAT_ADSTAT2_MASK                      equ 0004h
ADSTAT_ADMATH_POSN                       equ 0004h
ADSTAT_ADMATH_POSITION                   equ 0004h
ADSTAT_ADMATH_SIZE                       equ 0001h
ADSTAT_ADMATH_LENGTH                     equ 0001h
ADSTAT_ADMATH_MASK                       equ 0010h
ADSTAT_ADLTHR_POSN                       equ 0005h
ADSTAT_ADLTHR_POSITION                   equ 0005h
ADSTAT_ADLTHR_SIZE                       equ 0001h
ADSTAT_ADLTHR_LENGTH                     equ 0001h
ADSTAT_ADLTHR_MASK                       equ 0020h
ADSTAT_ADUTHR_POSN                       equ 0006h
ADSTAT_ADUTHR_POSITION                   equ 0006h
ADSTAT_ADUTHR_SIZE                       equ 0001h
ADSTAT_ADUTHR_LENGTH                     equ 0001h
ADSTAT_ADUTHR_MASK                       equ 0040h
ADSTAT_ADAOV_POSN                        equ 0007h
ADSTAT_ADAOV_POSITION                    equ 0007h
ADSTAT_ADAOV_SIZE                        equ 0001h
ADSTAT_ADAOV_LENGTH                      equ 0001h
ADSTAT_ADAOV_MASK                        equ 0080h
ADSTAT_ADSTAT_POSN                       equ 0000h
ADSTAT_ADSTAT_POSITION                   equ 0000h
ADSTAT_ADSTAT_SIZE                       equ 0003h
ADSTAT_ADSTAT_LENGTH                     equ 0003h
ADSTAT_ADSTAT_MASK                       equ 0007h
ADSTAT_STAT0_POSN                        equ 0000h
ADSTAT_STAT0_POSITION                    equ 0000h
ADSTAT_STAT0_SIZE                        equ 0001h
ADSTAT_STAT0_LENGTH                      equ 0001h
ADSTAT_STAT0_MASK                        equ 0001h
ADSTAT_STAT1_POSN                        equ 0001h
ADSTAT_STAT1_POSITION                    equ 0001h
ADSTAT_STAT1_SIZE                        equ 0001h
ADSTAT_STAT1_LENGTH                      equ 0001h
ADSTAT_STAT1_MASK                        equ 0002h
ADSTAT_STAT2_POSN                        equ 0002h
ADSTAT_STAT2_POSITION                    equ 0002h
ADSTAT_STAT2_SIZE                        equ 0001h
ADSTAT_STAT2_LENGTH                      equ 0001h
ADSTAT_STAT2_MASK                        equ 0004h

// Register: ADREF
#define ADREF ADREF
ADREF                                    equ 0116h
// bitfield definitions
ADREF_PREF_POSN                          equ 0000h
ADREF_PREF_POSITION                      equ 0000h
ADREF_PREF_SIZE                          equ 0002h
ADREF_PREF_LENGTH                        equ 0002h
ADREF_PREF_MASK                          equ 0003h
ADREF_ADPREF_POSN                        equ 0000h
ADREF_ADPREF_POSITION                    equ 0000h
ADREF_ADPREF_SIZE                        equ 0002h
ADREF_ADPREF_LENGTH                      equ 0002h
ADREF_ADPREF_MASK                        equ 0003h
ADREF_PREF0_POSN                         equ 0000h
ADREF_PREF0_POSITION                     equ 0000h
ADREF_PREF0_SIZE                         equ 0001h
ADREF_PREF0_LENGTH                       equ 0001h
ADREF_PREF0_MASK                         equ 0001h
ADREF_PREF1_POSN                         equ 0001h
ADREF_PREF1_POSITION                     equ 0001h
ADREF_PREF1_SIZE                         equ 0001h
ADREF_PREF1_LENGTH                       equ 0001h
ADREF_PREF1_MASK                         equ 0002h
ADREF_ADPREF0_POSN                       equ 0000h
ADREF_ADPREF0_POSITION                   equ 0000h
ADREF_ADPREF0_SIZE                       equ 0001h
ADREF_ADPREF0_LENGTH                     equ 0001h
ADREF_ADPREF0_MASK                       equ 0001h
ADREF_ADPREF1_POSN                       equ 0001h
ADREF_ADPREF1_POSITION                   equ 0001h
ADREF_ADPREF1_SIZE                       equ 0001h
ADREF_ADPREF1_LENGTH                     equ 0001h
ADREF_ADPREF1_MASK                       equ 0002h

