GopalSaraf/Practicals/PSDL/include/proc/pic16lf19155.inc
// Register: RTCCON
#define RTCCON RTCCON
RTCCON                                   equ 0C0Ch
// bitfield definitions
RTCCON_RTCCLKSEL_POSN                    equ 0000h
RTCCON_RTCCLKSEL_POSITION                equ 0000h
RTCCON_RTCCLKSEL_SIZE                    equ 0002h
RTCCON_RTCCLKSEL_LENGTH                  equ 0002h
RTCCON_RTCCLKSEL_MASK                    equ 0003h
RTCCON_HALFSEC_POSN                      equ 0003h
RTCCON_HALFSEC_POSITION                  equ 0003h
RTCCON_HALFSEC_SIZE                      equ 0001h
RTCCON_HALFSEC_LENGTH                    equ 0001h
RTCCON_HALFSEC_MASK                      equ 0008h
RTCCON_RTCSYNC_POSN                      equ 0004h
RTCCON_RTCSYNC_POSITION                  equ 0004h
RTCCON_RTCSYNC_SIZE                      equ 0001h
RTCCON_RTCSYNC_LENGTH                    equ 0001h
RTCCON_RTCSYNC_MASK                      equ 0010h
RTCCON_RTCWREN_POSN                      equ 0005h
RTCCON_RTCWREN_POSITION                  equ 0005h
RTCCON_RTCWREN_SIZE                      equ 0001h
RTCCON_RTCWREN_LENGTH                    equ 0001h
RTCCON_RTCWREN_MASK                      equ 0020h
RTCCON_RTCEN_POSN                        equ 0007h
RTCCON_RTCEN_POSITION                    equ 0007h
RTCCON_RTCEN_SIZE                        equ 0001h
RTCCON_RTCEN_LENGTH                      equ 0001h
RTCCON_RTCEN_MASK                        equ 0080h
RTCCON_RTCCLKSEL0_POSN                   equ 0000h
RTCCON_RTCCLKSEL0_POSITION               equ 0000h
RTCCON_RTCCLKSEL0_SIZE                   equ 0001h
RTCCON_RTCCLKSEL0_LENGTH                 equ 0001h
RTCCON_RTCCLKSEL0_MASK                   equ 0001h
RTCCON_RTCCLKSEL1_POSN                   equ 0001h
RTCCON_RTCCLKSEL1_POSITION               equ 0001h
RTCCON_RTCCLKSEL1_SIZE                   equ 0001h
RTCCON_RTCCLKSEL1_LENGTH                 equ 0001h
RTCCON_RTCCLKSEL1_MASK                   equ 0002h

// Register: RTCCAL
#define RTCCAL RTCCAL
RTCCAL                                   equ 0C0Dh
// bitfield definitions
RTCCAL_CAL_POSN                          equ 0000h
RTCCAL_CAL_POSITION                      equ 0000h
RTCCAL_CAL_SIZE                          equ 0008h
RTCCAL_CAL_LENGTH                        equ 0008h
RTCCAL_CAL_MASK                          equ 00FFh
RTCCAL_CAL0_POSN                         equ 0000h
RTCCAL_CAL0_POSITION                     equ 0000h
RTCCAL_CAL0_SIZE                         equ 0001h
RTCCAL_CAL0_LENGTH                       equ 0001h
RTCCAL_CAL0_MASK                         equ 0001h
RTCCAL_CAL1_POSN                         equ 0001h
RTCCAL_CAL1_POSITION                     equ 0001h
RTCCAL_CAL1_SIZE                         equ 0001h
RTCCAL_CAL1_LENGTH                       equ 0001h
RTCCAL_CAL1_MASK                         equ 0002h
RTCCAL_CAL2_POSN                         equ 0002h
RTCCAL_CAL2_POSITION                     equ 0002h
RTCCAL_CAL2_SIZE                         equ 0001h
RTCCAL_CAL2_LENGTH                       equ 0001h
RTCCAL_CAL2_MASK                         equ 0004h
RTCCAL_CAL3_POSN                         equ 0003h
RTCCAL_CAL3_POSITION                     equ 0003h
RTCCAL_CAL3_SIZE                         equ 0001h
RTCCAL_CAL3_LENGTH                       equ 0001h
RTCCAL_CAL3_MASK                         equ 0008h
RTCCAL_CAL4_POSN                         equ 0004h
RTCCAL_CAL4_POSITION                     equ 0004h
RTCCAL_CAL4_SIZE                         equ 0001h
RTCCAL_CAL4_LENGTH                       equ 0001h
RTCCAL_CAL4_MASK                         equ 0010h
RTCCAL_CAL5_POSN                         equ 0005h
RTCCAL_CAL5_POSITION                     equ 0005h
RTCCAL_CAL5_SIZE                         equ 0001h
RTCCAL_CAL5_LENGTH                       equ 0001h
RTCCAL_CAL5_MASK                         equ 0020h
RTCCAL_CAL6_POSN                         equ 0006h
RTCCAL_CAL6_POSITION                     equ 0006h
RTCCAL_CAL6_SIZE                         equ 0001h
RTCCAL_CAL6_LENGTH                       equ 0001h
RTCCAL_CAL6_MASK                         equ 0040h
RTCCAL_CAL7_POSN                         equ 0007h
RTCCAL_CAL7_POSITION                     equ 0007h
RTCCAL_CAL7_SIZE                         equ 0001h
RTCCAL_CAL7_LENGTH                       equ 0001h
RTCCAL_CAL7_MASK                         equ 0080h

// Register: ALRMCON
#define ALRMCON ALRMCON
ALRMCON                                  equ 0C0Eh
// bitfield definitions
ALRMCON_AMASK_POSN                       equ 0002h
ALRMCON_AMASK_POSITION                   equ 0002h
ALRMCON_AMASK_SIZE                       equ 0004h
ALRMCON_AMASK_LENGTH                     equ 0004h
ALRMCON_AMASK_MASK                       equ 003Ch
ALRMCON_CHIME_POSN                       equ 0006h
ALRMCON_CHIME_POSITION                   equ 0006h
ALRMCON_CHIME_SIZE                       equ 0001h
ALRMCON_CHIME_LENGTH                     equ 0001h
ALRMCON_CHIME_MASK                       equ 0040h
ALRMCON_ALRMEN_POSN                      equ 0007h
ALRMCON_ALRMEN_POSITION                  equ 0007h
ALRMCON_ALRMEN_SIZE                      equ 0001h
ALRMCON_ALRMEN_LENGTH                    equ 0001h
ALRMCON_ALRMEN_MASK                      equ 0080h
ALRMCON_AMASK0_POSN                      equ 0002h
ALRMCON_AMASK0_POSITION                  equ 0002h
ALRMCON_AMASK0_SIZE                      equ 0001h
ALRMCON_AMASK0_LENGTH                    equ 0001h
ALRMCON_AMASK0_MASK                      equ 0004h
ALRMCON_AMASK1_POSN                      equ 0003h
ALRMCON_AMASK1_POSITION                  equ 0003h
ALRMCON_AMASK1_SIZE                      equ 0001h
ALRMCON_AMASK1_LENGTH                    equ 0001h
ALRMCON_AMASK1_MASK                      equ 0008h
ALRMCON_AMASK2_POSN                      equ 0004h
ALRMCON_AMASK2_POSITION                  equ 0004h
ALRMCON_AMASK2_SIZE                      equ 0001h
ALRMCON_AMASK2_LENGTH                    equ 0001h
ALRMCON_AMASK2_MASK                      equ 0010h
ALRMCON_AMASK3_POSN                      equ 0005h
ALRMCON_AMASK3_POSITION                  equ 0005h
ALRMCON_AMASK3_SIZE                      equ 0001h
ALRMCON_AMASK3_LENGTH                    equ 0001h
ALRMCON_AMASK3_MASK                      equ 0020h

