GopalSaraf/Practicals/PSDL/include/proc/pic16lf19155.inc
// Register: LCDDATA6
#define LCDDATA6 LCDDATA6
LCDDATA6                                 equ 01D1Eh
// bitfield definitions
LCDDATA6_S00C1_POSN                      equ 0000h
LCDDATA6_S00C1_POSITION                  equ 0000h
LCDDATA6_S00C1_SIZE                      equ 0001h
LCDDATA6_S00C1_LENGTH                    equ 0001h
LCDDATA6_S00C1_MASK                      equ 0001h
LCDDATA6_S01C1_POSN                      equ 0001h
LCDDATA6_S01C1_POSITION                  equ 0001h
LCDDATA6_S01C1_SIZE                      equ 0001h
LCDDATA6_S01C1_LENGTH                    equ 0001h
LCDDATA6_S01C1_MASK                      equ 0002h
LCDDATA6_S02C1_POSN                      equ 0002h
LCDDATA6_S02C1_POSITION                  equ 0002h
LCDDATA6_S02C1_SIZE                      equ 0001h
LCDDATA6_S02C1_LENGTH                    equ 0001h
LCDDATA6_S02C1_MASK                      equ 0004h
LCDDATA6_S03C1_POSN                      equ 0003h
LCDDATA6_S03C1_POSITION                  equ 0003h
LCDDATA6_S03C1_SIZE                      equ 0001h
LCDDATA6_S03C1_LENGTH                    equ 0001h
LCDDATA6_S03C1_MASK                      equ 0008h
LCDDATA6_S04C1_POSN                      equ 0004h
LCDDATA6_S04C1_POSITION                  equ 0004h
LCDDATA6_S04C1_SIZE                      equ 0001h
LCDDATA6_S04C1_LENGTH                    equ 0001h
LCDDATA6_S04C1_MASK                      equ 0010h
LCDDATA6_S06C1_POSN                      equ 0006h
LCDDATA6_S06C1_POSITION                  equ 0006h
LCDDATA6_S06C1_SIZE                      equ 0001h
LCDDATA6_S06C1_LENGTH                    equ 0001h
LCDDATA6_S06C1_MASK                      equ 0040h
LCDDATA6_S07C1_POSN                      equ 0007h
LCDDATA6_S07C1_POSITION                  equ 0007h
LCDDATA6_S07C1_SIZE                      equ 0001h
LCDDATA6_S07C1_LENGTH                    equ 0001h
LCDDATA6_S07C1_MASK                      equ 0080h

// Register: LCDDATA7
#define LCDDATA7 LCDDATA7
LCDDATA7                                 equ 01D1Fh
// bitfield definitions
LCDDATA7_S08C1_POSN                      equ 0000h
LCDDATA7_S08C1_POSITION                  equ 0000h
LCDDATA7_S08C1_SIZE                      equ 0001h
LCDDATA7_S08C1_LENGTH                    equ 0001h
LCDDATA7_S08C1_MASK                      equ 0001h
LCDDATA7_S09C1_POSN                      equ 0001h
LCDDATA7_S09C1_POSITION                  equ 0001h
LCDDATA7_S09C1_SIZE                      equ 0001h
LCDDATA7_S09C1_LENGTH                    equ 0001h
LCDDATA7_S09C1_MASK                      equ 0002h
LCDDATA7_S10C1_POSN                      equ 0002h
LCDDATA7_S10C1_POSITION                  equ 0002h
LCDDATA7_S10C1_SIZE                      equ 0001h
LCDDATA7_S10C1_LENGTH                    equ 0001h
LCDDATA7_S10C1_MASK                      equ 0004h
LCDDATA7_S11C1_POSN                      equ 0003h
LCDDATA7_S11C1_POSITION                  equ 0003h
LCDDATA7_S11C1_SIZE                      equ 0001h
LCDDATA7_S11C1_LENGTH                    equ 0001h
LCDDATA7_S11C1_MASK                      equ 0008h
LCDDATA7_S13C1_POSN                      equ 0005h
LCDDATA7_S13C1_POSITION                  equ 0005h
LCDDATA7_S13C1_SIZE                      equ 0001h
LCDDATA7_S13C1_LENGTH                    equ 0001h
LCDDATA7_S13C1_MASK                      equ 0020h
LCDDATA7_S14C1_POSN                      equ 0006h
LCDDATA7_S14C1_POSITION                  equ 0006h
LCDDATA7_S14C1_SIZE                      equ 0001h
LCDDATA7_S14C1_LENGTH                    equ 0001h
LCDDATA7_S14C1_MASK                      equ 0040h
LCDDATA7_S15C1_POSN                      equ 0007h
LCDDATA7_S15C1_POSITION                  equ 0007h
LCDDATA7_S15C1_SIZE                      equ 0001h
LCDDATA7_S15C1_LENGTH                    equ 0001h
LCDDATA7_S15C1_MASK                      equ 0080h

// Register: LCDDATA8
#define LCDDATA8 LCDDATA8
LCDDATA8                                 equ 01D20h
// bitfield definitions
LCDDATA8_S18C1_POSN                      equ 0002h
LCDDATA8_S18C1_POSITION                  equ 0002h
LCDDATA8_S18C1_SIZE                      equ 0001h
LCDDATA8_S18C1_LENGTH                    equ 0001h
LCDDATA8_S18C1_MASK                      equ 0004h
LCDDATA8_S19C1_POSN                      equ 0003h
LCDDATA8_S19C1_POSITION                  equ 0003h
LCDDATA8_S19C1_SIZE                      equ 0001h
LCDDATA8_S19C1_LENGTH                    equ 0001h
LCDDATA8_S19C1_MASK                      equ 0008h
LCDDATA8_S20C1_POSN                      equ 0004h
LCDDATA8_S20C1_POSITION                  equ 0004h
LCDDATA8_S20C1_SIZE                      equ 0001h
LCDDATA8_S20C1_LENGTH                    equ 0001h
LCDDATA8_S20C1_MASK                      equ 0010h
LCDDATA8_S22C1_POSN                      equ 0006h
LCDDATA8_S22C1_POSITION                  equ 0006h
LCDDATA8_S22C1_SIZE                      equ 0001h
LCDDATA8_S22C1_LENGTH                    equ 0001h
LCDDATA8_S22C1_MASK                      equ 0040h
LCDDATA8_S23C1_POSN                      equ 0007h
LCDDATA8_S23C1_POSITION                  equ 0007h
LCDDATA8_S23C1_SIZE                      equ 0001h
LCDDATA8_S23C1_LENGTH                    equ 0001h
LCDDATA8_S23C1_MASK                      equ 0080h

// Register: LCDDATA12
#define LCDDATA12 LCDDATA12
LCDDATA12                                equ 01D24h
// bitfield definitions
LCDDATA12_S00C2_POSN                     equ 0000h
LCDDATA12_S00C2_POSITION                 equ 0000h
LCDDATA12_S00C2_SIZE                     equ 0001h
LCDDATA12_S00C2_LENGTH                   equ 0001h
LCDDATA12_S00C2_MASK                     equ 0001h
LCDDATA12_S01C2_POSN                     equ 0001h
LCDDATA12_S01C2_POSITION                 equ 0001h
LCDDATA12_S01C2_SIZE                     equ 0001h
LCDDATA12_S01C2_LENGTH                   equ 0001h
LCDDATA12_S01C2_MASK                     equ 0002h
LCDDATA12_S02C2_POSN                     equ 0002h
LCDDATA12_S02C2_POSITION                 equ 0002h
LCDDATA12_S02C2_SIZE                     equ 0001h
LCDDATA12_S02C2_LENGTH                   equ 0001h
LCDDATA12_S02C2_MASK                     equ 0004h
LCDDATA12_S03C2_POSN                     equ 0003h
LCDDATA12_S03C2_POSITION                 equ 0003h
LCDDATA12_S03C2_SIZE                     equ 0001h
LCDDATA12_S03C2_LENGTH                   equ 0001h
LCDDATA12_S03C2_MASK                     equ 0008h
LCDDATA12_S04C2_POSN                     equ 0004h
LCDDATA12_S04C2_POSITION                 equ 0004h
LCDDATA12_S04C2_SIZE                     equ 0001h
LCDDATA12_S04C2_LENGTH                   equ 0001h
LCDDATA12_S04C2_MASK                     equ 0010h
LCDDATA12_S06C2_POSN                     equ 0006h
LCDDATA12_S06C2_POSITION                 equ 0006h
LCDDATA12_S06C2_SIZE                     equ 0001h
LCDDATA12_S06C2_LENGTH                   equ 0001h
LCDDATA12_S06C2_MASK                     equ 0040h
LCDDATA12_S07C2_POSN                     equ 0007h
LCDDATA12_S07C2_POSITION                 equ 0007h
LCDDATA12_S07C2_SIZE                     equ 0001h
LCDDATA12_S07C2_LENGTH                   equ 0001h
LCDDATA12_S07C2_MASK                     equ 0080h

// Register: LCDDATA13
#define LCDDATA13 LCDDATA13
LCDDATA13                                equ 01D25h
// bitfield definitions
LCDDATA13_S08C2_POSN                     equ 0000h
LCDDATA13_S08C2_POSITION                 equ 0000h
LCDDATA13_S08C2_SIZE                     equ 0001h
LCDDATA13_S08C2_LENGTH                   equ 0001h
LCDDATA13_S08C2_MASK                     equ 0001h
LCDDATA13_S09C2_POSN                     equ 0001h
LCDDATA13_S09C2_POSITION                 equ 0001h
LCDDATA13_S09C2_SIZE                     equ 0001h
LCDDATA13_S09C2_LENGTH                   equ 0001h
LCDDATA13_S09C2_MASK                     equ 0002h
LCDDATA13_S10C2_POSN                     equ 0002h
LCDDATA13_S10C2_POSITION                 equ 0002h
LCDDATA13_S10C2_SIZE                     equ 0001h
LCDDATA13_S10C2_LENGTH                   equ 0001h
LCDDATA13_S10C2_MASK                     equ 0004h
LCDDATA13_S11C2_POSN                     equ 0003h
LCDDATA13_S11C2_POSITION                 equ 0003h
LCDDATA13_S11C2_SIZE                     equ 0001h
LCDDATA13_S11C2_LENGTH                   equ 0001h
LCDDATA13_S11C2_MASK                     equ 0008h
LCDDATA13_S13C2_POSN                     equ 0005h
LCDDATA13_S13C2_POSITION                 equ 0005h
LCDDATA13_S13C2_SIZE                     equ 0001h
LCDDATA13_S13C2_LENGTH                   equ 0001h
LCDDATA13_S13C2_MASK                     equ 0020h
LCDDATA13_S14C2_POSN                     equ 0006h
LCDDATA13_S14C2_POSITION                 equ 0006h
LCDDATA13_S14C2_SIZE                     equ 0001h
LCDDATA13_S14C2_LENGTH                   equ 0001h
LCDDATA13_S14C2_MASK                     equ 0040h
LCDDATA13_S15C2_POSN                     equ 0007h
LCDDATA13_S15C2_POSITION                 equ 0007h
LCDDATA13_S15C2_SIZE                     equ 0001h
LCDDATA13_S15C2_LENGTH                   equ 0001h
LCDDATA13_S15C2_MASK                     equ 0080h

// Register: LCDDATA14
#define LCDDATA14 LCDDATA14
LCDDATA14                                equ 01D26h
// bitfield definitions
LCDDATA14_S18C2_POSN                     equ 0002h
LCDDATA14_S18C2_POSITION                 equ 0002h
LCDDATA14_S18C2_SIZE                     equ 0001h
LCDDATA14_S18C2_LENGTH                   equ 0001h
LCDDATA14_S18C2_MASK                     equ 0004h
LCDDATA14_S19C2_POSN                     equ 0003h
LCDDATA14_S19C2_POSITION                 equ 0003h
LCDDATA14_S19C2_SIZE                     equ 0001h
LCDDATA14_S19C2_LENGTH                   equ 0001h
LCDDATA14_S19C2_MASK                     equ 0008h
LCDDATA14_S20C2_POSN                     equ 0004h
LCDDATA14_S20C2_POSITION                 equ 0004h
LCDDATA14_S20C2_SIZE                     equ 0001h
LCDDATA14_S20C2_LENGTH                   equ 0001h
LCDDATA14_S20C2_MASK                     equ 0010h
LCDDATA14_S22C2_POSN                     equ 0006h
LCDDATA14_S22C2_POSITION                 equ 0006h
LCDDATA14_S22C2_SIZE                     equ 0001h
LCDDATA14_S22C2_LENGTH                   equ 0001h
LCDDATA14_S22C2_MASK                     equ 0040h
LCDDATA14_S23C2_POSN                     equ 0007h
LCDDATA14_S23C2_POSITION                 equ 0007h
LCDDATA14_S23C2_SIZE                     equ 0001h
LCDDATA14_S23C2_LENGTH                   equ 0001h
LCDDATA14_S23C2_MASK                     equ 0080h

// Register: LCDDATA18
#define LCDDATA18 LCDDATA18
LCDDATA18                                equ 01D2Ah
// bitfield definitions
LCDDATA18_S00C3_POSN                     equ 0000h
LCDDATA18_S00C3_POSITION                 equ 0000h
LCDDATA18_S00C3_SIZE                     equ 0001h
LCDDATA18_S00C3_LENGTH                   equ 0001h
LCDDATA18_S00C3_MASK                     equ 0001h
LCDDATA18_S01C3_POSN                     equ 0001h
LCDDATA18_S01C3_POSITION                 equ 0001h
LCDDATA18_S01C3_SIZE                     equ 0001h
LCDDATA18_S01C3_LENGTH                   equ 0001h
LCDDATA18_S01C3_MASK                     equ 0002h
LCDDATA18_S02C3_POSN                     equ 0002h
LCDDATA18_S02C3_POSITION                 equ 0002h
LCDDATA18_S02C3_SIZE                     equ 0001h
LCDDATA18_S02C3_LENGTH                   equ 0001h
LCDDATA18_S02C3_MASK                     equ 0004h
LCDDATA18_S03C3_POSN                     equ 0003h
LCDDATA18_S03C3_POSITION                 equ 0003h
LCDDATA18_S03C3_SIZE                     equ 0001h
LCDDATA18_S03C3_LENGTH                   equ 0001h
LCDDATA18_S03C3_MASK                     equ 0008h
LCDDATA18_S04C3_POSN                     equ 0004h
LCDDATA18_S04C3_POSITION                 equ 0004h
LCDDATA18_S04C3_SIZE                     equ 0001h
LCDDATA18_S04C3_LENGTH                   equ 0001h
LCDDATA18_S04C3_MASK                     equ 0010h
LCDDATA18_S06C3_POSN                     equ 0006h
LCDDATA18_S06C3_POSITION                 equ 0006h
LCDDATA18_S06C3_SIZE                     equ 0001h
LCDDATA18_S06C3_LENGTH                   equ 0001h
LCDDATA18_S06C3_MASK                     equ 0040h
LCDDATA18_S07C3_POSN                     equ 0007h
LCDDATA18_S07C3_POSITION                 equ 0007h
LCDDATA18_S07C3_SIZE                     equ 0001h
LCDDATA18_S07C3_LENGTH                   equ 0001h
LCDDATA18_S07C3_MASK                     equ 0080h

// Register: LCDDATA19
#define LCDDATA19 LCDDATA19
LCDDATA19                                equ 01D2Bh
// bitfield definitions
LCDDATA19_S08C3_POSN                     equ 0000h
LCDDATA19_S08C3_POSITION                 equ 0000h
LCDDATA19_S08C3_SIZE                     equ 0001h
LCDDATA19_S08C3_LENGTH                   equ 0001h
LCDDATA19_S08C3_MASK                     equ 0001h
LCDDATA19_S09C3_POSN                     equ 0001h
LCDDATA19_S09C3_POSITION                 equ 0001h
LCDDATA19_S09C3_SIZE                     equ 0001h
LCDDATA19_S09C3_LENGTH                   equ 0001h
LCDDATA19_S09C3_MASK                     equ 0002h
LCDDATA19_S10C3_POSN                     equ 0002h
LCDDATA19_S10C3_POSITION                 equ 0002h
LCDDATA19_S10C3_SIZE                     equ 0001h
LCDDATA19_S10C3_LENGTH                   equ 0001h
LCDDATA19_S10C3_MASK                     equ 0004h
LCDDATA19_S11C3_POSN                     equ 0003h
LCDDATA19_S11C3_POSITION                 equ 0003h
LCDDATA19_S11C3_SIZE                     equ 0001h
LCDDATA19_S11C3_LENGTH                   equ 0001h
LCDDATA19_S11C3_MASK                     equ 0008h
LCDDATA19_S13C3_POSN                     equ 0005h
LCDDATA19_S13C3_POSITION                 equ 0005h
LCDDATA19_S13C3_SIZE                     equ 0001h
LCDDATA19_S13C3_LENGTH                   equ 0001h
LCDDATA19_S13C3_MASK                     equ 0020h
LCDDATA19_S14C3_POSN                     equ 0006h
LCDDATA19_S14C3_POSITION                 equ 0006h
LCDDATA19_S14C3_SIZE                     equ 0001h
LCDDATA19_S14C3_LENGTH                   equ 0001h
LCDDATA19_S14C3_MASK                     equ 0040h
LCDDATA19_S15C3_POSN                     equ 0007h
LCDDATA19_S15C3_POSITION                 equ 0007h
LCDDATA19_S15C3_SIZE                     equ 0001h
LCDDATA19_S15C3_LENGTH                   equ 0001h
LCDDATA19_S15C3_MASK                     equ 0080h

