GopalSaraf/Practicals/PSDL/include/proc/pic16lf19155.inc
// Register: LCDDATA20
#define LCDDATA20 LCDDATA20
LCDDATA20                                equ 01D2Ch
// bitfield definitions
LCDDATA20_S18C3_POSN                     equ 0002h
LCDDATA20_S18C3_POSITION                 equ 0002h
LCDDATA20_S18C3_SIZE                     equ 0001h
LCDDATA20_S18C3_LENGTH                   equ 0001h
LCDDATA20_S18C3_MASK                     equ 0004h
LCDDATA20_S19C3_POSN                     equ 0003h
LCDDATA20_S19C3_POSITION                 equ 0003h
LCDDATA20_S19C3_SIZE                     equ 0001h
LCDDATA20_S19C3_LENGTH                   equ 0001h
LCDDATA20_S19C3_MASK                     equ 0008h
LCDDATA20_S20C3_POSN                     equ 0004h
LCDDATA20_S20C3_POSITION                 equ 0004h
LCDDATA20_S20C3_SIZE                     equ 0001h
LCDDATA20_S20C3_LENGTH                   equ 0001h
LCDDATA20_S20C3_MASK                     equ 0010h
LCDDATA20_S22C3_POSN                     equ 0006h
LCDDATA20_S22C3_POSITION                 equ 0006h
LCDDATA20_S22C3_SIZE                     equ 0001h
LCDDATA20_S22C3_LENGTH                   equ 0001h
LCDDATA20_S22C3_MASK                     equ 0040h
LCDDATA20_S23C3_POSN                     equ 0007h
LCDDATA20_S23C3_POSITION                 equ 0007h
LCDDATA20_S23C3_SIZE                     equ 0001h
LCDDATA20_S23C3_LENGTH                   equ 0001h
LCDDATA20_S23C3_MASK                     equ 0080h

// Register: LCDDATA24
#define LCDDATA24 LCDDATA24
LCDDATA24                                equ 01D30h
// bitfield definitions
LCDDATA24_S00C4_POSN                     equ 0000h
LCDDATA24_S00C4_POSITION                 equ 0000h
LCDDATA24_S00C4_SIZE                     equ 0001h
LCDDATA24_S00C4_LENGTH                   equ 0001h
LCDDATA24_S00C4_MASK                     equ 0001h
LCDDATA24_S01C4_POSN                     equ 0001h
LCDDATA24_S01C4_POSITION                 equ 0001h
LCDDATA24_S01C4_SIZE                     equ 0001h
LCDDATA24_S01C4_LENGTH                   equ 0001h
LCDDATA24_S01C4_MASK                     equ 0002h
LCDDATA24_S02C4_POSN                     equ 0002h
LCDDATA24_S02C4_POSITION                 equ 0002h
LCDDATA24_S02C4_SIZE                     equ 0001h
LCDDATA24_S02C4_LENGTH                   equ 0001h
LCDDATA24_S02C4_MASK                     equ 0004h
LCDDATA24_S03C4_POSN                     equ 0003h
LCDDATA24_S03C4_POSITION                 equ 0003h
LCDDATA24_S03C4_SIZE                     equ 0001h
LCDDATA24_S03C4_LENGTH                   equ 0001h
LCDDATA24_S03C4_MASK                     equ 0008h
LCDDATA24_S04C4_POSN                     equ 0004h
LCDDATA24_S04C4_POSITION                 equ 0004h
LCDDATA24_S04C4_SIZE                     equ 0001h
LCDDATA24_S04C4_LENGTH                   equ 0001h
LCDDATA24_S04C4_MASK                     equ 0010h
LCDDATA24_S06C4_POSN                     equ 0006h
LCDDATA24_S06C4_POSITION                 equ 0006h
LCDDATA24_S06C4_SIZE                     equ 0001h
LCDDATA24_S06C4_LENGTH                   equ 0001h
LCDDATA24_S06C4_MASK                     equ 0040h
LCDDATA24_S07C4_POSN                     equ 0007h
LCDDATA24_S07C4_POSITION                 equ 0007h
LCDDATA24_S07C4_SIZE                     equ 0001h
LCDDATA24_S07C4_LENGTH                   equ 0001h
LCDDATA24_S07C4_MASK                     equ 0080h

// Register: LCDDATA25
#define LCDDATA25 LCDDATA25
LCDDATA25                                equ 01D31h
// bitfield definitions
LCDDATA25_S08C4_POSN                     equ 0000h
LCDDATA25_S08C4_POSITION                 equ 0000h
LCDDATA25_S08C4_SIZE                     equ 0001h
LCDDATA25_S08C4_LENGTH                   equ 0001h
LCDDATA25_S08C4_MASK                     equ 0001h
LCDDATA25_S09C4_POSN                     equ 0001h
LCDDATA25_S09C4_POSITION                 equ 0001h
LCDDATA25_S09C4_SIZE                     equ 0001h
LCDDATA25_S09C4_LENGTH                   equ 0001h
LCDDATA25_S09C4_MASK                     equ 0002h
LCDDATA25_S10C4_POSN                     equ 0002h
LCDDATA25_S10C4_POSITION                 equ 0002h
LCDDATA25_S10C4_SIZE                     equ 0001h
LCDDATA25_S10C4_LENGTH                   equ 0001h
LCDDATA25_S10C4_MASK                     equ 0004h
LCDDATA25_S11C4_POSN                     equ 0003h
LCDDATA25_S11C4_POSITION                 equ 0003h
LCDDATA25_S11C4_SIZE                     equ 0001h
LCDDATA25_S11C4_LENGTH                   equ 0001h
LCDDATA25_S11C4_MASK                     equ 0008h
LCDDATA25_S13C4_POSN                     equ 0005h
LCDDATA25_S13C4_POSITION                 equ 0005h
LCDDATA25_S13C4_SIZE                     equ 0001h
LCDDATA25_S13C4_LENGTH                   equ 0001h
LCDDATA25_S13C4_MASK                     equ 0020h
LCDDATA25_S14C4_POSN                     equ 0006h
LCDDATA25_S14C4_POSITION                 equ 0006h
LCDDATA25_S14C4_SIZE                     equ 0001h
LCDDATA25_S14C4_LENGTH                   equ 0001h
LCDDATA25_S14C4_MASK                     equ 0040h
LCDDATA25_S15C4_POSN                     equ 0007h
LCDDATA25_S15C4_POSITION                 equ 0007h
LCDDATA25_S15C4_SIZE                     equ 0001h
LCDDATA25_S15C4_LENGTH                   equ 0001h
LCDDATA25_S15C4_MASK                     equ 0080h

// Register: LCDDATA26
#define LCDDATA26 LCDDATA26
LCDDATA26                                equ 01D32h
// bitfield definitions
LCDDATA26_S18C4_POSN                     equ 0002h
LCDDATA26_S18C4_POSITION                 equ 0002h
LCDDATA26_S18C4_SIZE                     equ 0001h
LCDDATA26_S18C4_LENGTH                   equ 0001h
LCDDATA26_S18C4_MASK                     equ 0004h
LCDDATA26_S19C4_POSN                     equ 0003h
LCDDATA26_S19C4_POSITION                 equ 0003h
LCDDATA26_S19C4_SIZE                     equ 0001h
LCDDATA26_S19C4_LENGTH                   equ 0001h
LCDDATA26_S19C4_MASK                     equ 0008h
LCDDATA26_S20C4_POSN                     equ 0004h
LCDDATA26_S20C4_POSITION                 equ 0004h
LCDDATA26_S20C4_SIZE                     equ 0001h
LCDDATA26_S20C4_LENGTH                   equ 0001h
LCDDATA26_S20C4_MASK                     equ 0010h
LCDDATA26_S22C4_POSN                     equ 0006h
LCDDATA26_S22C4_POSITION                 equ 0006h
LCDDATA26_S22C4_SIZE                     equ 0001h
LCDDATA26_S22C4_LENGTH                   equ 0001h
LCDDATA26_S22C4_MASK                     equ 0040h
LCDDATA26_S23C4_POSN                     equ 0007h
LCDDATA26_S23C4_POSITION                 equ 0007h
LCDDATA26_S23C4_SIZE                     equ 0001h
LCDDATA26_S23C4_LENGTH                   equ 0001h
LCDDATA26_S23C4_MASK                     equ 0080h

// Register: LCDDATA30
#define LCDDATA30 LCDDATA30
LCDDATA30                                equ 01D36h
// bitfield definitions
LCDDATA30_S00C5_POSN                     equ 0000h
LCDDATA30_S00C5_POSITION                 equ 0000h
LCDDATA30_S00C5_SIZE                     equ 0001h
LCDDATA30_S00C5_LENGTH                   equ 0001h
LCDDATA30_S00C5_MASK                     equ 0001h
LCDDATA30_S01C5_POSN                     equ 0001h
LCDDATA30_S01C5_POSITION                 equ 0001h
LCDDATA30_S01C5_SIZE                     equ 0001h
LCDDATA30_S01C5_LENGTH                   equ 0001h
LCDDATA30_S01C5_MASK                     equ 0002h
LCDDATA30_S02C5_POSN                     equ 0002h
LCDDATA30_S02C5_POSITION                 equ 0002h
LCDDATA30_S02C5_SIZE                     equ 0001h
LCDDATA30_S02C5_LENGTH                   equ 0001h
LCDDATA30_S02C5_MASK                     equ 0004h
LCDDATA30_S03C5_POSN                     equ 0003h
LCDDATA30_S03C5_POSITION                 equ 0003h
LCDDATA30_S03C5_SIZE                     equ 0001h
LCDDATA30_S03C5_LENGTH                   equ 0001h
LCDDATA30_S03C5_MASK                     equ 0008h
LCDDATA30_S04C5_POSN                     equ 0004h
LCDDATA30_S04C5_POSITION                 equ 0004h
LCDDATA30_S04C5_SIZE                     equ 0001h
LCDDATA30_S04C5_LENGTH                   equ 0001h
LCDDATA30_S04C5_MASK                     equ 0010h
LCDDATA30_S06C5_POSN                     equ 0006h
LCDDATA30_S06C5_POSITION                 equ 0006h
LCDDATA30_S06C5_SIZE                     equ 0001h
LCDDATA30_S06C5_LENGTH                   equ 0001h
LCDDATA30_S06C5_MASK                     equ 0040h
LCDDATA30_S07C5_POSN                     equ 0007h
LCDDATA30_S07C5_POSITION                 equ 0007h
LCDDATA30_S07C5_SIZE                     equ 0001h
LCDDATA30_S07C5_LENGTH                   equ 0001h
LCDDATA30_S07C5_MASK                     equ 0080h

// Register: LCDDATA31
#define LCDDATA31 LCDDATA31
LCDDATA31                                equ 01D37h
// bitfield definitions
LCDDATA31_S08C5_POSN                     equ 0000h
LCDDATA31_S08C5_POSITION                 equ 0000h
LCDDATA31_S08C5_SIZE                     equ 0001h
LCDDATA31_S08C5_LENGTH                   equ 0001h
LCDDATA31_S08C5_MASK                     equ 0001h
LCDDATA31_S09C5_POSN                     equ 0001h
LCDDATA31_S09C5_POSITION                 equ 0001h
LCDDATA31_S09C5_SIZE                     equ 0001h
LCDDATA31_S09C5_LENGTH                   equ 0001h
LCDDATA31_S09C5_MASK                     equ 0002h
LCDDATA31_S10C5_POSN                     equ 0002h
LCDDATA31_S10C5_POSITION                 equ 0002h
LCDDATA31_S10C5_SIZE                     equ 0001h
LCDDATA31_S10C5_LENGTH                   equ 0001h
LCDDATA31_S10C5_MASK                     equ 0004h
LCDDATA31_S11C5_POSN                     equ 0003h
LCDDATA31_S11C5_POSITION                 equ 0003h
LCDDATA31_S11C5_SIZE                     equ 0001h
LCDDATA31_S11C5_LENGTH                   equ 0001h
LCDDATA31_S11C5_MASK                     equ 0008h
LCDDATA31_S13C5_POSN                     equ 0005h
LCDDATA31_S13C5_POSITION                 equ 0005h
LCDDATA31_S13C5_SIZE                     equ 0001h
LCDDATA31_S13C5_LENGTH                   equ 0001h
LCDDATA31_S13C5_MASK                     equ 0020h
LCDDATA31_S14C5_POSN                     equ 0006h
LCDDATA31_S14C5_POSITION                 equ 0006h
LCDDATA31_S14C5_SIZE                     equ 0001h
LCDDATA31_S14C5_LENGTH                   equ 0001h
LCDDATA31_S14C5_MASK                     equ 0040h
LCDDATA31_S15C5_POSN                     equ 0007h
LCDDATA31_S15C5_POSITION                 equ 0007h
LCDDATA31_S15C5_SIZE                     equ 0001h
LCDDATA31_S15C5_LENGTH                   equ 0001h
LCDDATA31_S15C5_MASK                     equ 0080h

// Register: LCDDATA32
#define LCDDATA32 LCDDATA32
LCDDATA32                                equ 01D38h
// bitfield definitions
LCDDATA32_S18C5_POSN                     equ 0002h
LCDDATA32_S18C5_POSITION                 equ 0002h
LCDDATA32_S18C5_SIZE                     equ 0001h
LCDDATA32_S18C5_LENGTH                   equ 0001h
LCDDATA32_S18C5_MASK                     equ 0004h
LCDDATA32_S19C5_POSN                     equ 0003h
LCDDATA32_S19C5_POSITION                 equ 0003h
LCDDATA32_S19C5_SIZE                     equ 0001h
LCDDATA32_S19C5_LENGTH                   equ 0001h
LCDDATA32_S19C5_MASK                     equ 0008h
LCDDATA32_S20C5_POSN                     equ 0004h
LCDDATA32_S20C5_POSITION                 equ 0004h
LCDDATA32_S20C5_SIZE                     equ 0001h
LCDDATA32_S20C5_LENGTH                   equ 0001h
LCDDATA32_S20C5_MASK                     equ 0010h
LCDDATA32_S22C5_POSN                     equ 0006h
LCDDATA32_S22C5_POSITION                 equ 0006h
LCDDATA32_S22C5_SIZE                     equ 0001h
LCDDATA32_S22C5_LENGTH                   equ 0001h
LCDDATA32_S22C5_MASK                     equ 0040h
LCDDATA32_S23C5_POSN                     equ 0007h
LCDDATA32_S23C5_POSITION                 equ 0007h
LCDDATA32_S23C5_SIZE                     equ 0001h
LCDDATA32_S23C5_LENGTH                   equ 0001h
LCDDATA32_S23C5_MASK                     equ 0080h

