GopalSaraf/Practicals/PSDL/include/proc/pic16lf19155.inc
#define ALRMHHR0                         BANKMASK(ALRMHR), 4
#define ALRMHHR1                         BANKMASK(ALRMHR), 5
#define ALRMHMIN0                        BANKMASK(ALRMMIN), 4
#define ALRMHMIN1                        BANKMASK(ALRMMIN), 5
#define ALRMHMIN2                        BANKMASK(ALRMMIN), 6
#define ALRMHMONTH                       BANKMASK(ALRMMTH), 4
#define ALRMHSEC0                        BANKMASK(ALRMSEC), 4
#define ALRMHSEC1                        BANKMASK(ALRMSEC), 5
#define ALRMHSEC2                        BANKMASK(ALRMSEC), 6
#define ALRMLDAY0                        BANKMASK(ALRMDAY), 0
#define ALRMLDAY1                        BANKMASK(ALRMDAY), 1
#define ALRMLDAY2                        BANKMASK(ALRMDAY), 2
#define ALRMLDAY3                        BANKMASK(ALRMDAY), 3
#define ALRMLHR0                         BANKMASK(ALRMHR), 0
#define ALRMLHR1                         BANKMASK(ALRMHR), 1
#define ALRMLHR2                         BANKMASK(ALRMHR), 2
#define ALRMLHR3                         BANKMASK(ALRMHR), 3
#define ALRMLMIN0                        BANKMASK(ALRMMIN), 0
#define ALRMLMIN1                        BANKMASK(ALRMMIN), 1
#define ALRMLMIN2                        BANKMASK(ALRMMIN), 2
#define ALRMLMIN3                        BANKMASK(ALRMMIN), 3
#define ALRMLMONTH0                      BANKMASK(ALRMMTH), 0
#define ALRMLMONTH1                      BANKMASK(ALRMMTH), 1
#define ALRMLMONTH2                      BANKMASK(ALRMMTH), 2
#define ALRMLMONTH3                      BANKMASK(ALRMMTH), 3
#define ALRMLSEC0                        BANKMASK(ALRMSEC), 0
#define ALRMLSEC1                        BANKMASK(ALRMSEC), 1
#define ALRMLSEC2                        BANKMASK(ALRMSEC), 2
#define ALRMLSEC3                        BANKMASK(ALRMSEC), 3
#define ALRMLWDAY0                       BANKMASK(ALRMWD), 0
#define ALRMLWDAY1                       BANKMASK(ALRMWD), 1
#define ALRMLWDAY2                       BANKMASK(ALRMWD), 2
#define AMASK0                           BANKMASK(ALRMCON), 2
#define AMASK1                           BANKMASK(ALRMCON), 3
#define AMASK2                           BANKMASK(ALRMCON), 4
#define AMASK3                           BANKMASK(ALRMCON), 5
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA3                            BANKMASK(ANSELA), 3
#define ANSA4                            BANKMASK(ANSELA), 4
#define ANSA6                            BANKMASK(ANSELA), 6
#define ANSA7                            BANKMASK(ANSELA), 7
#define ANSB0                            BANKMASK(ANSELB), 0
#define ANSB1                            BANKMASK(ANSELB), 1
#define ANSB2                            BANKMASK(ANSELB), 2
#define ANSB3                            BANKMASK(ANSELB), 3
#define ANSB4                            BANKMASK(ANSELB), 4
#define ANSB5                            BANKMASK(ANSELB), 5
#define ANSB6                            BANKMASK(ANSELB), 6
#define ANSB7                            BANKMASK(ANSELB), 7
#define ANSC2                            BANKMASK(ANSELC), 2
#define ANSC3                            BANKMASK(ANSELC), 3
#define ANSC4                            BANKMASK(ANSELC), 4
#define ANSC6                            BANKMASK(ANSELC), 6
#define ANSC7                            BANKMASK(ANSELC), 7
#define ARPT0                            BANKMASK(ALRMRPT), 0
#define ARPT1                            BANKMASK(ALRMRPT), 1
#define ARPT2                            BANKMASK(ALRMRPT), 2
#define ARPT3                            BANKMASK(ALRMRPT), 3
#define ARPT4                            BANKMASK(ALRMRPT), 4
#define ARPT5                            BANKMASK(ALRMRPT), 5
#define ARPT6                            BANKMASK(ALRMRPT), 6
#define ARPT7                            BANKMASK(ALRMRPT), 7
#define AS                               BANKMASK(SMT1STAT), 0
#define AS0E                             BANKMASK(CWG1AS1), 0
#define AS1E                             BANKMASK(CWG1AS1), 1
#define AS2E                             BANKMASK(CWG1AS1), 2
#define AS3E                             BANKMASK(CWG1AS1), 3
#define AS4E                             BANKMASK(CWG1AS1), 4
#define BCL1IE                           BANKMASK(PIE3), 1
#define BCL1IF                           BANKMASK(PIR3), 1
#define BF                               BANKMASK(SSP1STAT), 0
#define BF1                              BANKMASK(SSP1STAT), 0
#define BIAS0                            BANKMASK(LCDVCON1), 0
#define BIAS1                            BANKMASK(LCDVCON1), 1
#define BIAS2                            BANKMASK(LCDVCON1), 2
#define BOEN                             BANKMASK(SSP1CON3), 4
#define BORRDY                           BANKMASK(BORCON), 0
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define BSR5                             BANKMASK(BSR), 5
#define C1HYS                            BANKMASK(CM1CON0), 1
#define C1IE                             BANKMASK(PIE2), 0
#define C1IF                             BANKMASK(PIR2), 0
#define C1INTN                           BANKMASK(CM1CON1), 0
#define C1INTP                           BANKMASK(CM1CON1), 1
#define C1NCH0                           BANKMASK(CM1NSEL), 0
#define C1NCH1                           BANKMASK(CM1NSEL), 1
#define C1NCH2                           BANKMASK(CM1NSEL), 2
#define C1ON                             BANKMASK(CM1CON0), 7
#define C1PCH0                           BANKMASK(CM1PSEL), 0
#define C1PCH1                           BANKMASK(CM1PSEL), 1
#define C1PCH2                           BANKMASK(CM1PSEL), 2
#define C1POL                            BANKMASK(CM1CON0), 4
#define C1SYNC                           BANKMASK(CM1CON0), 0
#define C1TSEL0                          BANKMASK(CCPTMRS0), 0
#define C1TSEL1                          BANKMASK(CCPTMRS0), 1
#define C2HYS                            BANKMASK(CM2CON0), 1
#define C2IE                             BANKMASK(PIE2), 1
#define C2IF                             BANKMASK(PIR2), 1
#define C2INTN                           BANKMASK(CM2CON1), 0
#define C2INTP                           BANKMASK(CM2CON1), 1
#define C2NCH0                           BANKMASK(CM2NSEL), 0
#define C2NCH1                           BANKMASK(CM2NSEL), 1
#define C2NCH2                           BANKMASK(CM2NSEL), 2
#define C2ON                             BANKMASK(CM2CON0), 7
#define C2PCH0                           BANKMASK(CM2PSEL), 0
#define C2PCH1                           BANKMASK(CM2PSEL), 1
#define C2PCH2                           BANKMASK(CM2PSEL), 2
#define C2POL                            BANKMASK(CM2CON0), 4
#define C2SYNC                           BANKMASK(CM2CON0), 0
#define C2TSEL0                          BANKMASK(CCPTMRS0), 2
#define C2TSEL1                          BANKMASK(CCPTMRS0), 3
#define C3TSEL0                          BANKMASK(CCPTMRS0), 4
#define C3TSEL1                          BANKMASK(CCPTMRS0), 5
#define C4TSEL0                          BANKMASK(CCPTMRS0), 6
#define C4TSEL1                          BANKMASK(CCPTMRS0), 7
#define CAL0                             BANKMASK(RTCCAL), 0
#define CAL01                            BANKMASK(TMR1L), 0
#define CAL1                             BANKMASK(RTCCAL), 1
#define CAL11                            BANKMASK(TMR1L), 1
#define CAL2                             BANKMASK(RTCCAL), 2
#define CAL21                            BANKMASK(TMR1L), 2
#define CAL3                             BANKMASK(RTCCAL), 3
#define CAL31                            BANKMASK(TMR1L), 3
#define CAL4                             BANKMASK(RTCCAL), 4
#define CAL41                            BANKMASK(TMR1L), 4
#define CAL5                             BANKMASK(RTCCAL), 5
#define CAL51                            BANKMASK(TMR1L), 5
#define CAL6                             BANKMASK(RTCCAL), 6
#define CAL61                            BANKMASK(TMR1L), 6
#define CAL7                             BANKMASK(RTCCAL), 7
#define CAL71                            BANKMASK(TMR1L), 7
#define CALC0                            BANKMASK(ADCON3), 4
#define CALC1                            BANKMASK(ADCON3), 5
#define CALC2                            BANKMASK(ADCON3), 6
#define CARRY                            BANKMASK(STATUS), 0
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2
#define CCP1CTS3                         BANKMASK(CCP1CAP), 3
#define CCP1EN                           BANKMASK(CCP1CON), 7
#define CCP1FMT                          BANKMASK(CCP1CON), 4
#define CCP1IE                           BANKMASK(PIE6), 0
#define CCP1IF                           BANKMASK(PIR6), 0
#define CCP1MD                           BANKMASK(PMD3), 0
#define CCP1MODE0                        BANKMASK(CCP1CON), 0
#define CCP1MODE1                        BANKMASK(CCP1CON), 1
#define CCP1MODE2                        BANKMASK(CCP1CON), 2
#define CCP1MODE3                        BANKMASK(CCP1CON), 3
#define CCP1OE                           BANKMASK(CCP1CON), 6
#define CCP1OUT                          BANKMASK(CCP1CON), 5
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2
#define CCP2CTS3                         BANKMASK(CCP2CAP), 3
#define CCP2EN                           BANKMASK(CCP2CON), 7
#define CCP2FMT                          BANKMASK(CCP2CON), 4
#define CCP2IE                           BANKMASK(PIE6), 1
#define CCP2IF                           BANKMASK(PIR6), 1
#define CCP2MD                           BANKMASK(PMD3), 1
#define CCP2MODE0                        BANKMASK(CCP2CON), 0
#define CCP2MODE1                        BANKMASK(CCP2CON), 1
#define CCP2MODE2                        BANKMASK(CCP2CON), 2
#define CCP2MODE3                        BANKMASK(CCP2CON), 3
#define CCP2OE                           BANKMASK(CCP2CON), 6
#define CCP2OUT                          BANKMASK(CCP2CON), 5
#define CCP2PPS0                         BANKMASK(CCP2PPS), 0
#define CCP2PPS1                         BANKMASK(CCP2PPS), 1
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4
#define CCP3MD                           BANKMASK(PMD3), 2
#define CCP4MD                           BANKMASK(PMD3), 3
#define CDAFVR0                          BANKMASK(FVRCON), 2
#define CDAFVR1                          BANKMASK(FVRCON), 3
#define CDIV0                            BANKMASK(OSCCON2), 0
#define CDIV1                            BANKMASK(OSCCON2), 1
#define CDIV2                            BANKMASK(OSCCON2), 2
#define CDIV3                            BANKMASK(OSCCON2), 3
#define CHIME                            BANKMASK(ALRMCON), 6
#define CKE                              BANKMASK(SSP1STAT), 6
#define CKE1                             BANKMASK(SSP1STAT), 6
#define CKP                              BANKMASK(SSP1CON1), 4
#define CKP1                             BANKMASK(SSP1CON1), 4
#define CLC1IE                           BANKMASK(PIE5), 4
#define CLC1IF                           BANKMASK(PIR5), 4
#define CLC1MD                           BANKMASK(PMD5), 1
#define CLC2IE                           BANKMASK(PIE5), 5
#define CLC2IF                           BANKMASK(PIR5), 5
#define CLC2MD                           BANKMASK(PMD5), 2
#define CLC3IE                           BANKMASK(PIE5), 6
#define CLC3IF                           BANKMASK(PIR5), 6
#define CLC3MD                           BANKMASK(PMD5), 3
#define CLC4IE                           BANKMASK(PIE5), 7
#define CLC4IF                           BANKMASK(PIR5), 7
#define CLC4MD                           BANKMASK(PMD5), 4
#define CLCIN0PPS0                       BANKMASK(CLCIN0PPS), 0
#define CLCIN0PPS1                       BANKMASK(CLCIN0PPS), 1
#define CLCIN0PPS2                       BANKMASK(CLCIN0PPS), 2
#define CLCIN0PPS3                       BANKMASK(CLCIN0PPS), 3
#define CLCIN0PPS4                       BANKMASK(CLCIN0PPS), 4
#define CLCIN1PPS0                       BANKMASK(CLCIN1PPS), 0
#define CLCIN1PPS1                       BANKMASK(CLCIN1PPS), 1
#define CLCIN1PPS2                       BANKMASK(CLCIN1PPS), 2
#define CLCIN1PPS3                       BANKMASK(CLCIN1PPS), 3
#define CLCIN1PPS4                       BANKMASK(CLCIN1PPS), 4
#define CLCIN2PPS0                       BANKMASK(CLCIN2PPS), 0
#define CLCIN2PPS1                       BANKMASK(CLCIN2PPS), 1
#define CLCIN2PPS2                       BANKMASK(CLCIN2PPS), 2
#define CLCIN2PPS3                       BANKMASK(CLCIN2PPS), 3
#define CLCIN2PPS4                       BANKMASK(CLCIN2PPS), 4
#define CLCIN3PPS0                       BANKMASK(CLCIN3PPS), 0
#define CLCIN3PPS1                       BANKMASK(CLCIN3PPS), 1
#define CLCIN3PPS2                       BANKMASK(CLCIN3PPS), 2
#define CLCIN3PPS3                       BANKMASK(CLCIN3PPS), 3
#define CLCIN3PPS4                       BANKMASK(CLCIN3PPS), 4
#define CMP1MD                           BANKMASK(PMD2), 1
#define CMP2MD                           BANKMASK(PMD2), 2
#define CNT0                             BANKMASK(ADCNT), 0
#define CNT1                             BANKMASK(ADCNT), 1
#define CNT2                             BANKMASK(ADCNT), 2
#define CNT3                             BANKMASK(ADCNT), 3
#define CNT4                             BANKMASK(ADCNT), 4
#define CNT5                             BANKMASK(ADCNT), 5
#define CNT6                             BANKMASK(ADCNT), 6
#define CNT7                             BANKMASK(ADCNT), 7
#define CONT                             BANKMASK(ADCON0), 6
#define COSC0                            BANKMASK(OSCCON2), 4
#define COSC1                            BANKMASK(OSCCON2), 5
#define COSC2                            BANKMASK(OSCCON2), 6
#define CPOL                             BANKMASK(SMT1CON0), 2
#define CPR0                             BANKMASK(SMT1CPRL), 0
#define CPR1                             BANKMASK(SMT1CPRL), 1
#define CPR10                            BANKMASK(SMT1CPRH), 2
#define CPR11                            BANKMASK(SMT1CPRH), 3
#define CPR12                            BANKMASK(SMT1CPRH), 4
#define CPR13                            BANKMASK(SMT1CPRH), 5
#define CPR14                            BANKMASK(SMT1CPRH), 6
#define CPR15                            BANKMASK(SMT1CPRH), 7
#define CPR16                            BANKMASK(SMT1CPRU), 0
#define CPR17                            BANKMASK(SMT1CPRU), 1
#define CPR18                            BANKMASK(SMT1CPRU), 2
#define CPR19                            BANKMASK(SMT1CPRU), 3
#define CPR2                             BANKMASK(SMT1CPRL), 2
#define CPR20                            BANKMASK(SMT1CPRU), 4
#define CPR21                            BANKMASK(SMT1CPRU), 5
#define CPR22                            BANKMASK(SMT1CPRU), 6
#define CPR23                            BANKMASK(SMT1CPRU), 7
#define CPR3                             BANKMASK(SMT1CPRL), 3
#define CPR4                             BANKMASK(SMT1CPRL), 4
#define CPR5                             BANKMASK(SMT1CPRL), 5
#define CPR6                             BANKMASK(SMT1CPRL), 6
#define CPR7                             BANKMASK(SMT1CPRL), 7
#define CPR8                             BANKMASK(SMT1CPRH), 0
#define CPR9                             BANKMASK(SMT1CPRH), 1
#define CPRUP                            BANKMASK(SMT1STAT), 7
#define CPW0                             BANKMASK(SMT1CPWL), 0
#define CPW1                             BANKMASK(SMT1CPWL), 1
#define CPW10                            BANKMASK(SMT1CPWH), 2
#define CPW11                            BANKMASK(SMT1CPWH), 3
#define CPW12                            BANKMASK(SMT1CPWH), 4
#define CPW13                            BANKMASK(SMT1CPWH), 5
#define CPW14                            BANKMASK(SMT1CPWH), 6
#define CPW15                            BANKMASK(SMT1CPWH), 7
#define CPW16                            BANKMASK(SMT1CPWU), 0
#define CPW17                            BANKMASK(SMT1CPWU), 1
#define CPW18                            BANKMASK(SMT1CPWU), 2
#define CPW19                            BANKMASK(SMT1CPWU), 3
#define CPW2                             BANKMASK(SMT1CPWL), 2
#define CPW20                            BANKMASK(SMT1CPWU), 4
#define CPW21                            BANKMASK(SMT1CPWU), 5
#define CPW22                            BANKMASK(SMT1CPWU), 6
#define CPW23                            BANKMASK(SMT1CPWU), 7
#define CPW3                             BANKMASK(SMT1CPWL), 3
#define CPW4                             BANKMASK(SMT1CPWL), 4
#define CPW5                             BANKMASK(SMT1CPWL), 5
#define CPW6                             BANKMASK(SMT1CPWL), 6
#define CPW7                             BANKMASK(SMT1CPWL), 7
#define CPW8                             BANKMASK(SMT1CPWH), 0
#define CPW9                             BANKMASK(SMT1CPWH), 1
#define CPWDT                            BANKMASK(LCDVCON2), 7
#define CPWUP                            BANKMASK(SMT1STAT), 6
#define CRIE                             BANKMASK(PIE6), 7
#define CRIF                             BANKMASK(PIR6), 7
#define CRS0                             BANKMASK(ADCON2), 4
#define CRS1                             BANKMASK(ADCON2), 5
#define CRS2                             BANKMASK(ADCON2), 6
#define CS4                              BANKMASK(ADCLK), 4
#define CS5                              BANKMASK(ADCLK), 5
#define CSEL0                            BANKMASK(SMT1CLK), 0
#define CSEL1                            BANKMASK(SMT1CLK), 1
#define CSEL2                            BANKMASK(SMT1CLK), 2
#define CSWHOLD                          BANKMASK(OSCCON3), 7
#define CSWIE                            BANKMASK(PIE1), 6
#define CSWIF                            BANKMASK(PIR1), 6
#define CWG1CS                           BANKMASK(CWG1CLKCON), 0
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5
#define CWG1EN                           BANKMASK(CWG1CON0), 7
#define CWG1IE                           BANKMASK(PIE7), 0
#define CWG1IF                           BANKMASK(PIR7), 0
#define CWG1IN                           BANKMASK(CWG1CON1), 5
#define CWG1ISM0                         BANKMASK(CWG1ISM), 0
#define CWG1ISM1                         BANKMASK(CWG1ISM), 1
#define CWG1ISM2                         BANKMASK(CWG1ISM), 2
#define CWG1ISM3                         BANKMASK(CWG1ISM), 3
#define CWG1LD                           BANKMASK(CWG1CON0), 6
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5
#define CWG1MD                           BANKMASK(PMD4), 0
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2
#define CWG1OVRA                         BANKMASK(CWG1STR), 4
#define CWG1OVRB                         BANKMASK(CWG1STR), 5
#define CWG1OVRC                         BANKMASK(CWG1STR), 6
#define CWG1OVRD                         BANKMASK(CWG1STR), 7
#define CWG1POLA                         BANKMASK(CWG1CON1), 0
#define CWG1POLB                         BANKMASK(CWG1CON1), 1
#define CWG1POLC                         BANKMASK(CWG1CON1), 2
#define CWG1POLD                         BANKMASK(CWG1CON1), 3
#define CWG1PPS0                         BANKMASK(CWG1PPS), 0
#define CWG1PPS1                         BANKMASK(CWG1PPS), 1
#define CWG1PPS2                         BANKMASK(CWG1PPS), 2
#define CWG1PPS3                         BANKMASK(CWG1PPS), 3
#define CWG1PPS4                         BANKMASK(CWG1PPS), 4
#define CWG1REN                          BANKMASK(CWG1AS0), 6
#define CWG1SHUTDOWN                     BANKMASK(CWG1AS0), 7
#define CWG1STRA                         BANKMASK(CWG1STR), 0
#define CWG1STRB                         BANKMASK(CWG1STR), 1
#define CWG1STRC                         BANKMASK(CWG1STR), 2
#define CWG1STRD                         BANKMASK(CWG1STR), 3
#define C_SHAD                           BANKMASK(STATUS_SHAD), 0
#define DA                               BANKMASK(SSP1STAT), 5
#define DA1                              BANKMASK(SSP1STAT), 5
#define DAC1EN                           BANKMASK(DAC1CON0), 7
#define DAC1NSS                          BANKMASK(DAC1CON0), 0
#define DAC1OE1                          BANKMASK(DAC1CON0), 5
#define DAC1OE2                          BANKMASK(DAC1CON0), 4
#define DAC1PSS0                         BANKMASK(DAC1CON0), 2
#define DAC1PSS1                         BANKMASK(DAC1CON0), 3
#define DAC1R0                           BANKMASK(DAC1CON1), 0
#define DAC1R1                           BANKMASK(DAC1CON1), 1
#define DAC1R2                           BANKMASK(DAC1CON1), 2
#define DAC1R3                           BANKMASK(DAC1CON1), 3
#define DAC1R4                           BANKMASK(DAC1CON1), 4
#define DACMD                            BANKMASK(PMD2), 6
#define DATA_ADDRESS                     BANKMASK(SSP1STAT), 5
#define DATA_ADDRESS1                    BANKMASK(SSP1STAT), 5
#define DAYH0                            BANKMASK(DAY), 4
#define DAYH1                            BANKMASK(DAY), 5
#define DAYL0                            BANKMASK(DAY), 0
#define DAYL1                            BANKMASK(DAY), 1
#define DAYL2                            BANKMASK(DAY), 2
#define DAYL3                            BANKMASK(DAY), 3
#define DBF0                             BANKMASK(CWG1DBF), 0
#define DBF1                             BANKMASK(CWG1DBF), 1
#define DBF2                             BANKMASK(CWG1DBF), 2
#define DBF3                             BANKMASK(CWG1DBF), 3
#define DBF4                             BANKMASK(CWG1DBF), 4
#define DBF5                             BANKMASK(CWG1DBF), 5
#define DBR0                             BANKMASK(CWG1DBR), 0
#define DBR1                             BANKMASK(CWG1DBR), 1
#define DBR2                             BANKMASK(CWG1DBR), 2
#define DBR3                             BANKMASK(CWG1DBR), 3
#define DBR4                             BANKMASK(CWG1DBR), 4
